In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'1.5.1'

In [3]:
tuple = ("Joe",67,1667548004)
s1 = pd.Series(tuple)

In [4]:
s1

0           Joe
1            67
2    1667548004
dtype: object

In [5]:
type(s1)

pandas.core.series.Series

In [6]:
type(s1.values)

numpy.ndarray

In [7]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
# s1[-1] # IDs
s1[2] # IDs

1667548004

In [9]:
students = pd.Series(0,index=["Joe","Lisa","Viktoria","Nick"])

In [10]:
students

Joe         0
Lisa        0
Viktoria    0
Nick        0
dtype: int64

In [11]:
students["Nick":"Joe":-1]

Nick        0
Viktoria    0
Lisa        0
Joe         0
dtype: int64

In [12]:
students[::-1]

Nick        0
Viktoria    0
Lisa        0
Joe         0
dtype: int64

In [13]:
pd.Series(10,index=range(10))

0    10
1    10
2    10
3    10
4    10
5    10
6    10
7    10
8    10
9    10
dtype: int64

In [14]:
dict = {"name":"Joe","age":67,"ID":1667548004,1:"one","two":2,3:3}
dict

{'name': 'Joe', 'age': 67, 'ID': 1667548004, 1: 'one', 'two': 2, 3: 3}

In [15]:
dicronary_Series = pd.Series(dict)
dicronary_Series

name           Joe
age             67
ID      1667548004
1              one
two              2
3                3
dtype: object

In [16]:
dicronary_Series[1]

'one'

In [17]:
sdata = {"Minnesota": 55000, "Ohio": 35000, "California": 45000}
states = ["Ohio","California","Minnesota","Utah"]
s1 = pd.Series(sdata,states)
s1

Ohio          35000.0
California    45000.0
Minnesota     55000.0
Utah              NaN
dtype: float64

In [18]:
pd.isnull(s1)

Ohio          False
California    False
Minnesota     False
Utah           True
dtype: bool

In [19]:
pd.notnull(s1)

Ohio           True
California     True
Minnesota      True
Utah          False
dtype: bool

In [20]:
data = {"California": 35000, "Ohio": 7000, "Oregon": 16000, "Texas": 21000}
obj1 = pd.Series(data)
obj1

California    35000
Ohio           7000
Oregon        16000
Texas         21000
dtype: int64

In [21]:
obj1["California":"Oregon"]

California    35000
Ohio           7000
Oregon        16000
dtype: int64

In [22]:
obj1[1::2]

Ohio      7000
Texas    21000
dtype: int64

In [23]:
obj2 = pd.Series(data,index=["Ohio","Oregon","Texas","Utah"])
print(obj1)
print(obj2)

California    35000
Ohio           7000
Oregon        16000
Texas         21000
dtype: int64
Ohio       7000.0
Oregon    16000.0
Texas     21000.0
Utah          NaN
dtype: float64

In [24]:
obj1 + obj2

California        NaN
Ohio          14000.0
Oregon        32000.0
Texas         42000.0
Utah              NaN
dtype: float64

In [25]:
obj1[obj1<20000]*2

Ohio      14000
Oregon    32000
dtype: int64

In [26]:
obj1

California    35000
Ohio           7000
Oregon        16000
Texas         21000
dtype: int64

In [27]:
names = np.array(["Joe","Lisa","Viktoria","Nick","Viktor","Alex","Maria","Max","Bob","Virgil","Vladimir","Vlad","Jessie","Gus","Valter"])
names.shape

(15,)

In [28]:
ds1 = pd.Series(np.random.randint(0,100,15),names)
ds1

Joe         47
Lisa        17
Viktoria    88
Nick        16
Viktor       6
Alex        10
Maria       22
Max         55
Bob         14
Virgil      17
Vladimir    36
Vlad        57
Jessie      46
Gus         88
Valter      95
dtype: int32

In [29]:
ds1.values

array([47, 17, 88, 16,  6, 10, 22, 55, 14, 17, 36, 57, 46, 88, 95])

In [30]:
ds1.keys()

Index(['Joe', 'Lisa', 'Viktoria', 'Nick', 'Viktor', 'Alex', 'Maria', 'Max',
       'Bob', 'Virgil', 'Vladimir', 'Vlad', 'Jessie', 'Gus', 'Valter'],
      dtype='object')

In [31]:
ds1[:2]

Joe     47
Lisa    17
dtype: int32

In [32]:
ds1[3:9:2]

Nick    16
Alex    10
Max     55
dtype: int32

In [33]:
customer_info = {"Jan":125,"Feb":50,"Mar":200,"Apr":175,"May":225}

In [34]:
customer = pd.Series(customer_info)
customer

Jan    125
Feb     50
Mar    200
Apr    175
May    225
dtype: int64

In [35]:
customer[2:5]

Mar    200
Apr    175
May    225
dtype: int64

In [36]:
m_names = ["Jan","Feb","Mar","Apr","May","Jun","Jul"]

In [37]:
customer_info_new = pd.Series(customer_info,index=m_names)
customer_info_new

Jan    125.0
Feb     50.0
Mar    200.0
Apr    175.0
May    225.0
Jun      NaN
Jul      NaN
dtype: float64

In [38]:
customer_info_new[customer_info_new.isnull()]

Jun   NaN
Jul   NaN
dtype: float64

In [39]:
customer_info_new["Mar":"May"]

Mar    200.0
Apr    175.0
May    225.0
dtype: float64

In [40]:
result = customer_info_new[customer_info_new<100]
result

Feb    50.0
dtype: float64

In [41]:
result2 = customer_info_new[customer_info_new<200] * 5
result2

Jan    625.0
Feb    250.0
Apr    875.0
dtype: float64

In [42]:
population_dict = {
    "California":38332521,
    "Texas":26448193,
    "New York":19651127,
    "Florida":19552860,
    "Illinois":12882135
}

In [47]:
population = pd.Series(population_dict)

In [49]:
df = pd.DataFrame(population,columns=["population"])
df

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [50]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [59]:
users = pd.DataFrame([{"userName":"joe","age":67,"ID":1667548004,"pass":"qwerty000"},{"pass":"lisa","age":67,"userName":"f"}])
users

  userName  age            ID       pass
0      joe   67  1.667548e+09  qwerty000
1        f   67           NaN       lisa

In [54]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [56]:
ind[1] = 0

TypeError: Index does not support mutable operations

In [94]:
area = {"California": 35000, "NewYork": 50000, "Florida": 16000,
        "Texas": 21000, "Illinois": 10000}
population = {"California": 651893.1, "NewYork": 50012341200,
              "Florida": 41465244, "Texas": 65724255, "Illinois": 256724523,"Ohio": 65724255}
area

{'California': 35000,
 'NewYork': 50000,
 'Florida': 16000,
 'Texas': 21000,
 'Illinois': 10000}

In [95]:
state_data =pd.DataFrame({"area":area,"population":population})
state_data

               area    population
California  35000.0  6.518931e+05
NewYork     50000.0  5.001234e+10
Florida     16000.0  4.146524e+07
Texas       21000.0  6.572426e+07
Illinois    10000.0  2.567245e+08
Ohio            NaN  6.572426e+07

In [96]:
area = {"California": 35000, "NewYork": 50000, "Florida": 16000,
        "Texas": 21000, "Illinois": 10000, 'Florida': 60000, 'Alaska': 100000}

In [97]:
areaS = pd.Series(area)
areaS

California     35000
NewYork        50000
Florida        60000
Texas          21000
Illinois       10000
Alaska        100000
dtype: int64

In [105]:
state_data.index

Index(['California', 'NewYork', 'Florida', 'Texas', 'Illinois', 'Ohio'], dtype='object')

In [99]:
areaS.index

Index(['California', 'NewYork', 'Florida', 'Texas', 'Illinois', 'Alaska'], dtype='object')

In [100]:
inBoth = areaS.index&state_data.index
inBoth

C:\Users\luche\AppData\Local\Temp\ipykernel_11108\2430217885.py:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  inBoth = areaS.index&state_data.index

Index(['California', 'NewYork', 'Florida', 'Texas', 'Illinois'], dtype='object')

In [102]:
unique = areaS.index^state_data.index
unique

C:\Users\luche\AppData\Local\Temp\ipykernel_11108\3072479751.py:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead.
  unique = areaS.index^state_data.index

Index(['Alaska', 'Ohio'], dtype='object')

In [106]:
"NewYork" in state_data.index

True

In [125]:
if~("Chicago" in state_data.index):
    state_data["Chicago"]

In [127]:
if~("MeanProfit" in state_data):
    for i in range((len(state_data.index))):
        state_data["MeanProfit"][i] = i

C:\Users\luche\AppData\Local\Temp\ipykernel_11108\159760941.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  state_data["MeanProfit"][i] = i

In [128]:
state_data

               area    population  MeanProfit
California  35000.0  6.518931e+05           0
NewYork     50000.0  5.001234e+10           1
Florida     16000.0  4.146524e+07           2
Texas       21000.0  6.572426e+07           3
Illinois    10000.0  2.567245e+08           4
Ohio            NaN  6.572426e+07           5

In [135]:
state_data.iloc[1]

area          5.000000e+04
population    5.001234e+10
MeanProfit    1.000000e+00
Name: NewYork, dtype: float64

In [133]:
state_data.loc["Illinois"]

area              10000.0
population    256724523.0
MeanProfit            4.0
Name: Illinois, dtype: float64